Part 2 – VLANs, Layer-2 EtherChannel
1. In Office A, configure a Layer-2 EtherChannel named PortChannel1 between DSW-A1 and DSW-A2 using a Cisco-proprietary protocol. Both switches should actively 
try to form an EtherChannel.


DSW-A1(config)#int port-channel 1
DSW-A1(config-if)#switchport mode trunk
DSW-A1(config)#int range Gig 1/0/4-5
DSW-A1(config-if-range)#channel-group 1 mode desirable 


2. In Office B, configure a Layer-2 EtherChannel named PortChannel1 between DSW-B1 and DSW-B2 using an open standard protocol. Both switches should actively try 
to form an EtherChannel.

DSW-A1(config)#int port-channel 1
DSW-A1(config-if)#switchport mode trunk
DSW-B1(config)#int range GigabitEthernet1/0/4-5
DSW-B1(config-if-range)#channel-group 1 mode active



3. Configure all links between Access and Distribution switches, including the EtherChannels, as trunk links.

ASW-A1(config)#int Gig0/1
ASW-A1(config-if)#switchport mode trunk 
ASW-A1(config-if)#int g0/2
ASW-A1(config-if)#switchport mode trunk

ASW-A2(config)#int range g0/1-2
ASW-A2(config-if-range)#switchport mode trunk

ASW-A3(config)#int range Gig0/1-2
ASW-A3(config-if-range)#switchport mode trunk

DSW-A1(config)#int range Gig 1/0/1-3
DSW-A1(config-if-range)#switchport mode trunk

DSW-A2(config-if-range)#int range Gig 1/0/1-3
DSW-A2(config-if-range)#switchport mode trunk 

ASW-B1(config)#int range Gig 0/1-2
ASW-B1(config-if-range)#switchport mode trunk

ASW-B2(config)#int range Gig 0/1-2
ASW-B2(config-if-range)#switchport mode trunk

ASW-B3(config)#int range Gig 0/1-2
ASW-B3(config-if-range)#switchport mode trunk

DSW-B1(config)#int range Gig 1/0/1-3
DSW-B1(config-if-range)#switchport mode trunk

DSW-B2(config)#int range Gig 1/0/1-3
DSW-B2(config-if-range)#switchport mode trunk



    a. Explicitly disable DTP on all ports.

ASW-A1(config)#int range g0/1-2
ASW-A1(config-if-range)#switchport nonegotiate 

(do this on all trunk ports)




    b. Set each trunk’s native VLAN to VLAN 1000 (unused).


ASW-A1(config)#int range g0/1-2
ASW-A1(config-if-range)#switchport trunk native vlan 1000

(repeat for all trunk ports on all switches)





    c. In Office A, allow VLANs 10, 20, 40, and 99 on all trunks.

ASW-A1(config)#int range g0/1-2
ASW-A1(config-if-range)#switchport trunk allowed vlan 10,20,40,99

(repeat on all trunk ports)




    d. In Office B, allow VLANs 10, 20, 30, and 99 on all trunks.

ASW-B1(config)#int range g0/1-2
ASW-B1(config-if-range)#switchport trunk allowed vlan 10,20,30,99

(repeat on all trunk ports)




4. Configure one of each office’s Distribution switches as a VTPv2 server. Use domain name JeremysITLab.

DSW-A1(config)#vtp mode server
DSW-A1(config)#vtp domain JeremeysITLab



    a. Verify that other switches join the domain.

  



    b. Configure all Access switches as VTP clients.





5. In Office A, create and name the following VLANs on one of the Distribution switches. Ensure that VTP propagates the changes.
    a. VLAN 10: PCs
    b. VLAN 20: Phones
    c. VLAN 40: Wi-Fi
    d. VLAN 99: Management
6. In Office B, create and name the following VLANs on one of the Distribution switches. Ensure that VTP propagates the changes.
    a. VLAN 10: PCs
    b. VLAN 20: Phones
    c. VLAN 30: Servers
    d. VLAN 99: Management
7. Configure each Access switch’s access port. 
    a. LWAPs will not use FlexConnect
    b. PCs in VLAN 10, Phones in VLAN 20
    c. SRV1 in VLAN 30
    d. Manually configure access mode and explicitly disable DTP
8. Configure ASW-A1’s connection to WLC1:
    a. It must support the Wi-Fi and Management VLANs.
    b. The Management VLAN should be untagged.
    c. Disable DTP.
9. Administratively disable all unused ports on Access and Distribution switches.






