!! Configure the switchports connecting to switches as trunks. Disable DTP on the ports. Confirm the admin and operational mode of each interface !!

SW1# config t
SW1(config) interface g0/1
SW1(config-if) switchport mode trunk
SW1(config-if) switchport nonegotiate
SW1(config-if) end
SW1# show interface g0/1 switchport

SW2# config t
SW2(config) interface g0/1
SW2(config-if) switchport mode trunk
SW2(config-if) switchport nonegotiate
SW2(config-if) end
SW2# show interface g0/1 switchport

SW2# config t
SW2(config) interface g0/2
SW2(config-if) switchport mode trunk
SW2(config-if) switchport nonegotiate
SW2(config-if) end
SW2# show interface g0/2 switchport

SW3# config t
SW3(config) interface g0/1
SW3(config-if) switchport mode trunk
SW3(config-if) switchport nonegotiate
SW3(config-if) end
SW3# show interface g0/1 switchport

!! Configure SW1 in VTP domain CCNA. Create VLANs 10, 20, 30 on SW1. Have SW2 and SW3 added VLANs 10, 20, 30? !!

SW1# config t
SW1(config) vtp domain CCNA
SW1(config) vlan 10
SW1(config-vlan) vlan 20
SW1(config-vlan) vlan 30
!! Answer is YES. By default VTP is enabled and switches act as servers and will automatically join VTP domains. !!

!! Configure SW2 in VTP transparent mode. Add VLAN 40 to SW2. Is VLAN 40 added to the VLAN database of SW1/3? !!

SW2# config t
SW2(config) vtp mode transparent
SW2(config) vlan 40
SW2(config-if) end
SW2# show vlan 

SW1# show vlan brief

SW3# show vlan brief
!! Answer is NO. VTP transparent mode will not advertise its VLANs that it adds. !!

!! Configure SW3 in VTP client mode. Try to configure VLAN 50 on SW3. Does it add? !!

SW3# config t
SW3(config) vtp mode client
SW3(config) vlan 50
###throws error because clients cannot add/modify/delete VLANs###

!! Configure all switchports connected to hosts in the correct VLAN. Manually configure them as access ports. Is DTP still enabled on the switchports? !!

DTP is not enabled anymore after switching those interfaces to access ports manually. By default, default switchports are configured in dynamic auto (new switches). Once you configure as access ports, it disables DTP.






























